validationTestCases/WFDS-singleTreeSimple/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

Uinlet          (1.2 0 0);

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform $Uinlet;

boundaryField
{

    xMin
    {
        type                    logProfileVelocityInlet;
        UfreeStream             1.2;
        uDirection              (1 0 0);
        inputWindHeight_Veg     40;
        z0                      0.01;   // value not given in the paper, assuming it is grass
        Rd                      0;
        firstCellHeight         1;  // dz
    }
    xMax
    {
        type            pressureInletOutletVelocity;
        value           uniform (0 0 0);
    }
	yMin
    {
        type            pressureInletOutletVelocity;
        value           uniform (0 0 0);
    }
	yMax
    {
        type            pressureInletOutletVelocity;
        value           uniform (0 0 0);
    }
	zMax
    {
        type            zeroGradient;
    }

    ground
    {
		type            fixedValue;
        value           uniform (0 0 0);
    }

}

// ************************************************************************* //
