validationTestCases/WFDS-singleTreeSimple/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0.0;

boundaryField
{

    xMin
    {
        type            calculated;
        value           uniform 0;
    }
    xMax
    {
        type            calculated;
        value           uniform 0;
    }
	yMin
    {
        type            calculated;
        value           uniform 0;
    }
	yMax
    {
        type            calculated;
        value           uniform 0;
    }
	zMax
    {
        type            calculated;
        value           uniform 0;
    }

    ground
    {
        type            myNutkAtmRoughWallFunction;
        z0              uniform 0.01;   // value not given in the paper, assuming it is grass
        value           uniform 0.1;
    }

}


// ************************************************************************* //
